# GetComponentManualEdgeOffset

## Description
Gets the manual edge offset of a component in an object.

```pascal
FUNCTION GetComponentManualEdgeOffset(
				object               : HANDLE;
				componentIndex       : INTEGER;
				VAR manualEdgeOffset : REAL) : BOOLEAN;
```

```python

def vs.GetComponentManualEdgeOffset(object, componentIndex):
    return (BOOLEAN, manualEdgeOffset)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|object|HANDLE|The object. Can be a  slab, Slab Style, or the Slab Preferences.|
|componentIndex|INTEGER|The index of the component.|
|manualEdgeOffset|REAL|Returns the manual edge offset.|

## See Also
VS Functions:
SetComponentManualEdgeOffset

## Version
Availability: from Vectorworks 2011
## Category
* Objects - Architectural